micropython/micropython/ports/esp32/boards/XIAO_ESP32S3/mpconfigboard.h
#define MICROPY_HW_BOARD_NAME               "XIAO-ESP32S3"
#define MICROPY_HW_MCU_NAME                 "ESP32-S3-FN8"
#define MICROPY_PY_NETWORK_HOSTNAME_DEFAULT "XIAO-ESP32S3"

#define MICROPY_PY_MACHINE_DAC              (0)

#define MICROPY_HW_I2C0_SCL                 (6)
#define MICROPY_HW_I2C0_SDA                 (5)

#define MICROPY_HW_SPI1_MOSI                (9)
#define MICROPY_HW_SPI1_MISO                (8)
#define MICROPY_HW_SPI1_SCK                 (7)
